---
kind: property
id: P:Autodesk.Revit.DB.XYZ.BasisX
zh: 点
source: html/a3d8e6ab-72ef-84c6-d058-dc67b4090219.htm
---
# Autodesk.Revit.DB.XYZ.BasisX Property

**中文**: 点

The basis of the X axis.

## Syntax (C#)
```csharp
public static XYZ BasisX { get; }
```

## Remarks
The basis of the X axis is the vector (1,0,0), the unit vector on the X axis.